[{
    "title": "Week 1 Reflection",
    "date": "Friday, Week 1",
    "author": "Corey Horgan",
    "content": "In the design process, I felt a mix of excitement and nervousness. This was due to the fact that I was working on a new project with a very open brief of what I was needing to accomplish and a tight deadline to stay on track. I think that my  research and planning phase went very well because I was able to get a good understanding of where I think I should take this project early on and I was able to accomplish my sprint goal of getting the work done early leaving more time for my interviews. I think that my brainstorming didn't go the best because I found it hard to come up with ideas that I was happy with and I think that this was due to the fact that I was trying to do too much at once. I think that I can improve on this by taking a step back and looking at what the target audience would need to help solve their problems. I think for my next sprint i will spend more time on trying to empathise with what the target audience would need and how they could be benefitted through this problem."
},


{
    "title": "Week 2 Reflection",
    "date": "Friday, Week 2",
    "author": "Corey Horgan",
    "content": "I think that this week my interviews went very well because I was able to get a good understanding and insights of what real young people are experiencing in their lives. and this information that I received backed up my research and planning phase. I felt very comfortable in this phase because all of the information that I was able to gather from my interviews was very helpful and I was able to get a good understanding of what the target audience would need. I think that the creation of my solution didn't go that well because I was finding it hard to try and decipher a way to make it unique and different from what is already out there. I think that this is due to trying to enter an already saturated market with my issue and solution. Next time I believe that I can improve on this by taking a step back and spending more time on planning a solution that can be different from the rest in a new and exciting way, while still being realistic and helpful to the target audience. for the next sprint i will be focusing on my proof of concept and trying to get a good understanding of how each core idea will be working."
},

{
    "title": "Week 3 Reflection",
    "date": "Friday, Week 3",
    "author": "Corey Horgan",
    "content": "I believe that this week I made good progress in shaping my brands identity, lo-fi prototyping and Proof of concepts. I explored a wide range of visual directions and came to a conclusion that I believe will best fit within my target audience's preferences. I chose a visual direction that aims to feel more fun and engaging. Some parts of this process was very overwhelming and I didn't know where to start but I think the main thing that i struggled with was the proof of concept because i had never heard of this before and was very confused with how to approach something like this with not a lot of knowledge on how to show that proof of concept off without the tools yet to make it. I think that i need to research into how to make my proof of concepts more viable before i start this process next time because it would take a lot less stress off my shoulders and give me more time to work on my project and spend less time overthinking the small things. For my next sprint im going spend more time planning the things i struggle with early so i can have a deeper understanding on how to complete them leaving more time for other tasks in my project."
},


{
    "title": "Week 4 Reflection",
    "date": "Friday, Week 4",
    "author": "Corey Horgan",
    "content": "This week I believe that I did quite well on the creation of my design strategy document because of the clear planning that I had for the document early on. I also think that that the completion of the brand visual direction went quite well because of the creation of things like the illustrations and logo giving me a clear idea of how this will look and where i can go next. I think that my pitch presentation didn't go very well because I didn't understand what information to include in my slides, as well as me not being the most confident speaker I missed a lot of what i was meant to say. This made me appear very behind with my idea and not too much of a clear idea on where I could head next. The feedback that I received on my brand on how to present was very beneficial and I will hopefully be able to implement it into my next presentation. For my next sprint I will be focusing on the creation of my wireframes and will be spending more time on planning the things I struggle with early"
},

{
    "title": "Week 5 Reflection",
    "date": "Friday, Week 5",
    "author": "Corey Horgan",
    "content": "This week I believe that my creation of my wireframes went quite well because I focused on the flows that have a greater impact on what the site is and how it works rather than wasting my time on building all avenues that exist on the app. I also believe that the creation of my brand guidelines went quite well because of the clear visual direction that I had in mind and the ability to show it in a clear way. The thing that didn't go well was the creation of the style guide. This was because of procrastination and me not knowing where to start on the creation of one. This week I have learnt what a style guide is and how it can be used in a company's branding. For the next sprint I will be making the Hi-fi prototype of a mobile app and be preparing for my wip 02 presentation and be focusing on improving how i present."
},


{
    "title": "Week 6 Reflection",
    "date": "Friday, Week 6",
    "author": "Corey Horgan",
    "content": "This week I believe that my creation of the Hi-fi prototype went quite well because I was able to create a clear and concise prototype that shows the user flow and how the app works. The feedback that I received on my hi-fi during my wip 02 presentation was very beneficial as well. It gave me a clear direction of what changes should be made and how I can improve the idea more for the future. I don't think there were many negatives to this week because everything went quite well but i did forget that i was planning out flushing out what my blog looks like and understanding how i can use a database in my main project. I think that I should have spent less time before the wip on fixing the small details and wasting time and waiting till after the feedback to make those changes because a lot of them were redundant and that time could have been spent elsewhere. For the next sprint i will be working on the coding of my final project and building a basis for my final presentation."
}




]